<?php
/**
 * Created by PhpStorm.
 * User: gendos
 * Date: 11/6/17
 * Time: 20:50
 */

return [
    'general' => [
        'your' => 'ваш',
        'next' => 'Следующая',
        'previous' => 'Предыдущая',
        'edit' => 'Редактировать',
        'delete' => 'Удалить',
    ],
    'nav-items' => [
        'login' => 'Вход',
    ],
    'header' => [
        'do_register' => 'Зарегистрироваться',
        'homepage' => 'Главная',
        'all' => 'Все новости',
        'by_categories' => 'по Категориям',
        'by_tags' => 'по Тегам',
        'news' => 'Страница новости',
        'contact_us' => 'Обратная связь',
        'login' => 'Вход (для зарегистрированных пользователей)',
        'logout' => 'Выход',
        'register' => 'Регистрация (новый пользователь)',
    ],
    'main' => [
        'welcome' => 'Битва Новостей от PHP-Academy - Домашняя страница',
        '404' => 'Страница не найдена',
        'categories_list' => 'Список категорий',
        'news_list' => 'Список страниц',
        'register' => 'Форма регистрации пользователя',
    ],
    'admin' => [
        'categories_mgmt' => 'Управление категориями новостей',
        'news_mgmt' => 'Управление страницами новостей',
        'create_newspage' => 'Создать страницу новости',
        'create_category' => 'Добавить категорию',
        'categories' => 'Категории',
        'news' => 'Новости',
        'ads' => 'Реклама',
        'header_users' => 'Пользователи',
        'header_comments' => 'Комментарии',
        'contacts_view' => 'Просмотр сообщений пользователей',
        'contacts_list' => 'Список сообщений пользователей',
        'edit_contact' => 'Редактирование сообщений пользователей',
        'edit_users' => 'Пользователи',
        'edit_user' => 'Редактирование данных пользователя',
        'users_list' => 'Список пользователей',
        'users' => 'Зарегистрированные пользователи',
        'users_edit_active' => 'Деактивировать пользователя',
    ],
    'form' => [
        'name' => 'имя',
        'login' => 'логин',
        'email' => 'эл. адрес',
        'password' => 'пароль',
        'confirm' => 'подтвердите',
        'send' => 'Отправить',
        'sign-in' => 'Вход',
        'register' => 'Регистрация',
        'save' => 'Сохранить',
        'search' => 'Поиск',
        'reset' => 'Отмена',
        'choose_your_login' => 'выберите ваш логин',
        'your_e-mail_here' => 'укажите ваш эл. адрес',
        'enter_password' => 'пароль',
        'confirm_password' => 'подтверждение пароля',
    ],
    'contact' => [
        'name' => 'Ваше имя',
        'email' => 'Ваш e-mail',
        'message' => 'Ваше сообщение',
    ],
    'users' => [
        'todo' => 'Действия',
        'name' => 'Имя',
        'login' => 'Логин',
        'email' => 'Эл.почта',
        'role' => 'Роль',
        'active' => 'Активен?',
    ],
    'busket' => [
        'caption' => 'Корзина',
    ],
];