<?php
/**
 * Created by PhpStorm.
 * User: gendos
 * Date: 11/6/17
 * Time: 20:50
 */

return [
    'header' => [
        'do_register' => 'Зарегистрироваться',
        'homepage' => 'Главная',
        'pages' => 'Страницы',
        'contact_us' => 'Обратная связь',
        'login' => 'Вход',
        'logout' => 'Выход',
        'register' => 'Регистрация (новый пользователь)',
    ],
    'main' => [
        'welcome' => 'Домашняя страница',
        '404' => 'Страница не найдена',
        'pages_list' => 'Список страниц',
        'register' => 'Форма регистрации пользователя',
    ],
    'admin' => [
        'pages_mgmt' => 'Управление страницами',
        'create_page' => 'Создать страницу',
        'edit_page' => 'Редактировать страницу',
        'header_users' => 'Пользователи',
        'header_contacts' => 'Сообщения',
        'contacts_view' => 'Просмотр сообщений пользователей',
        'contacts_list' => 'Список сообщений пользователей',
        'edit_contact' => 'Редактирование сообщений пользователей',
        'edit_users' => 'Пользователи',
        'edit_user' => 'Редактирование данных пользователя',
        'users_list' => 'Список пользователей',
        'users' => 'Зарегистрированные пользователи',
        'users_edit_active' => 'Деактивировать пользователя',
    ],
    'form' => [
        'send' => 'Отправить',
        'save' => 'Сохранить',
        'reset' => 'Отмена',
    ],
    'contact' => [
        'name' => 'Ваше имя',
        'email' => 'Ваш e-mail',
        'message' => 'Ваше сообщение',
    ],
    'users' => [
        'todo' => 'Действия',
        'login' => 'Логин',
        'email' => 'Эл.почта',
        'role' => 'Роль',
        'active' => 'Активен?',
    ],
];